Revit 2027 API
ParameterTypeId.StructuralAttachmentBaseType Property
 "Base Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentBaseType { get; }
Public Shared ReadOnly Property StructuralAttachmentBaseType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentBaseType {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentBaseType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace